In [1]:
import pandas as pd
import numpy as np
import tensorflow as tf
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
foods = pd.Series(["Almond butter", "Eggs", "Avocado"])
prices = pd.Series([9, 6, 2])

In [3]:
relation = pd.DataFrame({'Foods': foods, 
                        'Prices': prices})

In [4]:
relation

           Foods  Prices
0  Almond butter       9
1           Eggs       6
2        Avocado       2

In [5]:
carSales = pd.read_csv('./car-sales.csv')

In [6]:
carSales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [7]:
tf.__version__

'2.1.0'

In [8]:
carSales.to_csv('../OpenCV/exportedCarSales')

In [9]:
heartDisease = pd.read_csv('./heart-diseases.csv')

In [10]:
heartDisease

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [11]:
heartDisease['sex'] =  heartDisease['sex'].map({1: 'M', 0: 'F'})

In [12]:
heartDisease

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,M,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,M,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,F,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,M,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,F,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,F,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,M,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,M,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,M,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,F,1,130,236,0,0,174,0,0.0,1,1,2,0

In [13]:
carSales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [14]:
carSales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [15]:
carSales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [16]:
carSales.info()
carSales['doors'] = None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [17]:
carSales.mean()

Odometer (KM)    78601.4
Doors                4.0
doors                NaN
dtype: float64

In [18]:
carSales.head(7)

     Make Colour  Odometer (KM)  Doors       Price doors
0  Toyota  White         150043      4   $4,000.00  None
1   Honda    Red          87899      4   $5,000.00  None
2  Toyota   Blue          32549      3   $7,000.00  None
3     BMW  Black          11179      5  $22,000.00  None
4  Nissan  White         213095      4   $3,500.00  None
5  Toyota  Green          99213      4   $4,500.00  None
6   Honda   Blue          45698      4   $7,500.00  None

In [19]:
carSales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price doors
7   Honda   Blue          54738      4  $7,000.00  None
8  Toyota  White          60000      4  $6,250.00  None
9  Nissan  White          31600      4  $9,700.00  None

In [26]:
carSales.iloc[1:3]

     Make Colour  Odometer (KM)  Doors      Price doors
1   Honda    Red      54936.875      4  $5,000.00  None
2  Toyota   Blue      20343.125      3  $7,000.00  None

In [ ]:
carSales[carSales['Doors'] > 3]

In [ ]:
pd.crosstab(carSales['Make'], carSales['Doors'])

In [ ]:
carSales['Odometer (KM)'].plot()

In [ ]:
carSales['Odometer (KM)'].hist()

In [ ]:
carSales["Price"] = carSales["Price"].str.replace('[\$\,\.]', '').astype(int)

In [ ]:
carSales['Price'].hist()

In [ ]:
carSales['Colour'].str.lower()

In [ ]:
carSales

In [ ]:
carSales['Colour'] =  carSales['Colour'].str.lower()

In [ ]:
carSales

In [22]:
missingCarSales = pd.read_csv('./car-sales-extended-missing-data.csv')

In [23]:
missingCarSales

       Make Colour  Odometer (KM)  Doors    Price
0     Honda  White        35431.0    4.0  15323.0
1       BMW   Blue       192714.0    5.0  19943.0
2     Honda  White        84714.0    4.0  28343.0
3    Toyota  White       154365.0    4.0  13434.0
4    Nissan   Blue       181577.0    3.0  14043.0
..      ...    ...            ...    ...      ...
995  Toyota  Black        35820.0    4.0  32042.0
996     NaN  White       155144.0    3.0   5716.0
997  Nissan   Blue        66604.0    4.0  31570.0
998   Honda  White       215883.0    4.0   4001.0
999  Toyota   Blue       248360.0    4.0  12732.0

[1000 rows x 5 columns]

In [24]:
missingCarSales['Odometer (KM)'].fillna(missingCarSales['Odometer (KM)'].mean(), inplace = True)

In [25]:
missingCarSales

       Make Colour  Odometer (KM)  Doors    Price
0     Honda  White        35431.0    4.0  15323.0
1       BMW   Blue       192714.0    5.0  19943.0
2     Honda  White        84714.0    4.0  28343.0
3    Toyota  White       154365.0    4.0  13434.0
4    Nissan   Blue       181577.0    3.0  14043.0
..      ...    ...            ...    ...      ...
995  Toyota  Black        35820.0    4.0  32042.0
996     NaN  White       155144.0    3.0   5716.0
997  Nissan   Blue        66604.0    4.0  31570.0
998   Honda  White       215883.0    4.0   4001.0
999  Toyota   Blue       248360.0    4.0  12732.0

[1000 rows x 5 columns]

In [ ]:
missingCarSales.dropna(inplace = True)

In [ ]:
missingCarSales

## Adding a new Column to the DataFrame

In [ ]:
carSales

In [ ]:
seats = pd.Series(np.arange(0,10))
carSales['Seats'] = seats

In [ ]:
economy = np.array(np.random.rand(10)*15)
carSales['Fuel per KM'] = economy

In [ ]:
carSales

In [ ]:
carSales['Total Fuel Used'] = carSales['Odometer (KM)']/100 * carSales['Fuel per KM']
carSales

In [ ]:
carSales['No. of models'] = 5
carSales

In [ ]:
carSales.drop('No. of models', axis=1, inplace=True)

In [ ]:
carSales

In [ ]:
carSaleShuffled = carSales.sample(frac = 1)

In [ ]:
carSaleShuffled

In [ ]:
carSaleShuffled.reset_index(inplace = True, drop = True)

In [ ]:
carSaleShuffled

In [20]:
carSales['Odometer (KM)'] = carSales['Odometer (KM)'].apply(lambda x: x/1.6)

In [21]:
carSales

     Make Colour  Odometer (KM)  Doors       Price doors
0  Toyota  White      93776.875      4   $4,000.00  None
1   Honda    Red      54936.875      4   $5,000.00  None
2  Toyota   Blue      20343.125      3   $7,000.00  None
3     BMW  Black       6986.875      5  $22,000.00  None
4  Nissan  White     133184.375      4   $3,500.00  None
5  Toyota  Green      62008.125      4   $4,500.00  None
6   Honda   Blue      28561.250      4   $7,500.00  None
7   Honda   Blue      34211.250      4   $7,000.00  None
8  Toyota  White      37500.000      4   $6,250.00  None
9  Nissan  White      19750.000      4   $9,700.00  None

In [ ]:
carSales.rename(columns = {'amamama' : 'Odometer (Mi)'}, inplace=True, errors = 'raise')

In [ ]:
carSales